# Introduction to pandas

This notebook will introduce you to the [`pandas`](https://pandas.pydata.org/) data analysis library and demonstrate how to inspect, sort, filter, group and aggregate a data set.

The data for this exercise will be a CSV of [USA TODAY's opening-day MLB salaries](https://www.usatoday.com/sports/mlb/salaries/) from the 2018 season.

(If you're completely new to Python or your syntax is rusty, it might be useful to [keep this notebook open in a new tab](Python%20syntax%20cheat%20sheet.ipynb) as a reference.)

#### Ssession outline
- [Using Jupyter notebooks](#Using-Jupyter-notebooks)
- [Import pandas](#Import-pandas)
- [Load data into a data frame](#Load-data-into-a-data-frame)
- [Inspect the data](#Inspect-the-data)
- [Sort the data](#Sort-the-data)
- [Filter the data](#Filter-the-data)
- [Group and aggregate the data](#Group-and-aggregate-the-data)

### Using Jupyter notebooks

There are many ways to write and run Python code on your computer. One way -- the method we're using today -- is to use [Jupyter notebooks](https://jupyter.org/), which run in your browser and allow you to intersperse documentation with your code. They're handy for bundling your code with a human-readable explanation of what's happening at each step. Check out some examples from the [L.A. Times](https://github.com/datadesk/notebooks) and [BuzzFeed News](https://github.com/BuzzFeedNews/everything#data-and-analyses).

**To add a new cell to your notebook**: Click the + button in the menu.

**To run a cell of code**: Select the cell and click the "Run" button in the menu, or you can press Shift+Enter.

**One common gotcha**: The notebook doesn't "know" about code you've written until you've _run_ the cell containing it. For example, if you define a variable called `my_name` in one cell, and later, when you try to access that variable in another cell but get an error that says `NameError: name 'my_name' is not defined`, the most likely solution is to run (or re-run) the cell in which you defined `my_name`.

### Import pandas

Before you can use the functionality of `pandas`, a third-party library installed separately from Python, you need to _import_ it. The convention is to import the library under an alias that's easier to type: `as pd`.

Run this cell:

In [ ]:
import pandas as pd

### Load data into a data frame

Before you can start poking at a data file, you need to load the data into a pandas _data frame_, which is sort of like a virtual spreadsheet with columns and rows.

You can load many different types of data files into a data frame, including CSVs (and other delimited text files), Excel files, JSON [and more](https://www.cbtnuggets.com/blog/2018/10/14-file-types-you-can-import-into-pandas/). ([Here's a quick reference notebook](https://github.com/ireapps/cfj-2018/blob/master/reference/Importing%20data%20into%20pandas.ipynb) demonstrating how to import some different data files, including live data from the Internet!)

For today, we'll focus on importing the MLB salary data using a pandas method called [`read_csv()`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html). There are a ton of options you can supply when you read in the data file, but at minimum, you need to tell the method _where_ the file lives, which means you need to supply the path to the data file as a Python _string_ (some text enclosed in single or double quotes). The file is called `mlb.csv`, and it is located in the same directory as this notebook file, so we don't need to specify a longer path.

As we import the data, we'll also _assign_ the results of the loading operation to a new variable called _df_ (short for data frame -- easy to type, plus you'll see this pattern a lot when Googling around for help).

👉 [Click here for more information on Python variables](Python%20syntax%20cheat%20sheet.ipynb#Variable-assignment).

In [ ]:
df = pd.read_csv('mlb.csv')

As a human sentence: "Go to the pandas library that we imported earlier as something called `pd` and use its `read_csv()` method to import a file called `mlb.csv` into a data frame -- and while we're at it, assign the results of that operation to a new variable called `df`."

### Inspect the data

Let's take a look at what we've got using a few built-in methods and attributes of a pandas data frame:
- `df.head()` will display the first five records (or, if you prefer, you can specify a number, e.g., `df.head(10)`)
- `df.tail()` will display the last five records (or, if you prefer, you can specify a number, e.g., `df.tail(10)`)
- `df.describe()` will compute summary stats on numeric columns
- `df.sample()` will return a randomly selected record (or, if you prefer, you specify a number, e.g., `df.sample(5)`
- `df.shape` will tell you how many columns, how many rows
- `df.dtypes` will list the column names and tell you what kind of data is in each one

### Sort the data

To sort a data frame, use the `sort_values()` method. At a minimum, you need to tell it which column to sort on.

In [ ]:
df.sort_values('SALARY')

To sort descending, you need to pass in another argument to the `sort_values()` method: `ascending=False`. Note that the boolean value is _not_ a string, so it's not contained in quotes, and only the initial letter is capitalized. (If you are supplying multiple arguments to a function or method, separate them with commas.)

👉 [Click here for more information on Python booleans](Python%20syntax%20cheat%20sheet.ipynb#Booleans).

In [ ]:
df.sort_values('SALARY', ascending=False)

You can use a process called "method chaining" to perform multiple operations in one line. If, for instance, we wanted to sort the data frame by salary descending and inspect the first 5 records returned:

In [ ]:
df.sort_values('SALARY', ascending=False).head()

You can sort by multiple columns by passing in a _list_ of column names rather than the name of a single column. A list is a collection of items enclosed within square brackets `[]`.

👉 [Click here for more information on Python lists](Python%20syntax%20cheat%20sheet.ipynb#Lists).

To sort first by `SALARY`, then by `TEAM`:

In [ ]:
df.sort_values(['SALARY', 'TEAM']).head()

You can specify the sort order (descending vs. ascending) for each sort column by passing another list to the `ascending` keyword with `True` and `False` items corresponding to the position of the columns in the first list. 

For example, to sort by `SALARY` descending, then by `TEAM` ascending:

In [ ]:
df.sort_values(['SALARY', 'TEAM'], ascending=[False, True]).head()

The `False` goes with `SALARY` and the `True` with `TEAM` because they're in the same position in their respective lists.

One other note: Despite all of this sorting we've been doing, the original `df` data frame is unchanged:

In [ ]:
df.head()

That's because we haven't "saved" the results of those sorts by assigning them to a new variable. Typically, if you want to preserve a sort (or any other kind of manipulation), you'd would assign the results to a new variable:

In [ ]:
sorted_by_team = df.sort_values('TEAM')

In [ ]:
sorted_by_team.head()

### ✍️ Your turn

In the cells below, practice sorting the `df` data frame:
- By `NAME`
- By `POS` descending
- By `SALARY` descending, then by `POS` ascending, and save the results to a new variable called `sorted_by_salary_then_pos`

### Filter the data

Let's go over two different kinds of filtering:

- Column filtering: Grabbing one or more columns of data to look at, like passing column names to a `SELECT` statement in SQL.
- Row filtering: Looking at a subset of your data that matches some criteria, like the crieria following a `WHERE` statement in SQL. (For instance, "Show me all records in my data frame where the value in the `TEAM` column is "ARI".)

#### Column filtering

To access the values in a single column of data, you can use "dot notation" as long as the column name doesn't have spaces or other special characters:

In [ ]:
df.TEAM

Otherwise, use "bracket notation" with the name of the column as a string.

This is equivalent to the previous command:

In [ ]:
df['TEAM']

To select multiple columns in your data frame, use bracket notation but pass in a _list_ of column names instead of just one. To make things clearer, you could break this out into two steps:

In [ ]:
columns_we_care_about = ['TEAM', 'SALARY']
df[columns_we_care_about]

Quick aside: When you access a single column in your data frame, you're getting back something called a `Series` object (as opposed to a `DataFrame` object).

For numeric columns, you can call methods on that Series to compute basic summary stats:
- `min()` to get the lowest value
- `max()` to get the greatest value
- `median()` to get the median
- `mean()` to get the average
- `mode()` to get the most common value

Check it out for the `SALARY` column:

In [ ]:
df.SALARY.min()

In [ ]:
df.SALARY.max()

In [ ]:
df.SALARY.median()

In [ ]:
df.SALARY.mean()

In [ ]:
df.SALARY.mode()

You can look at the unique values in a column with `unique()` -- let's do that with the `TEAM` column:

In [ ]:
df.TEAM.unique()

What we just did is the equivalent of dragging the "TEAM" column name into the "rows" area of a spreadsheet pivot table, or, in SQL,

```sql
SELECT DISTINCT TEAM
FROM mlb
```

You can also count up a total for each value using the `value_counts()` method:

In [ ]:
df.TEAM.value_counts()

#### Row filtering

To make things maximally confusing, you _also_ use bracket notation for row filtering. Except in this case, instead of dropping the name of a column (or a list of column names) into the brackets, you hand it a _condition_ of some sort.

Let's filter our data to see players who make more than $1 million (in other words, return rows of data where the value in the `SALARY` column is greater than 1000000):

(The equivalent SQL statement would be:
```sql
SELECT *
FROM mlb
WHERE SALARY > 1000000
```
)

In [ ]:
df[df.SALARY > 1000000]

For many filters, you'll use Python's comparison operators:
- `>` greater than
- `>=` greater than or equal to
- `<` less than
- `<=` less than or equal to
- `==` equal to
- `!=` not equal to

#### Multiple filter conditions

What if you want to use multiple filtering conditions? There is a way, but it usually makes more sense -- and is much easier for your colleagues and your future self to think about and debug -- to _save_ the results of each filtering operation by assigning the results to a new variable, then filter _that_ again instead of the original data frame.

For example, if you wanted to look at Colorado Rockies players who make more than $1 million, you might do something like:

In [ ]:
rockies = df[df.TEAM == 'COL']
rockies_over_1m = rockies[rockies.SALARY > 1000000]

In [ ]:
rockies_over_1m

👉 [Check out some other filtering operations here]().

### ✍️ Your turn

In the cells below, practice filtering:
- Column filtering: Select the `NAME` column
- Column filtering: Select the `NAME` and `TEAM` columns
- Row filtering: Filter the rows to return only players who make the league minimum (535000)
- Row filtering: Filter the rows to return only catchers (`C`) who make at least 750000
- BONUS: Filter the rows to return only players for the Chicago Cubs (`CHC`), then use method chaining to order the results by `SALARY` descending

### Group and aggregate the data

Data frames have a `groupby` method for grouping and aggregating data, similar to what you might do in a pivot table or a `GROUP BY` statement in SQL. (They also have a [`pivot_table` method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html), which can be homework for you to research.)

Let's say we wanted to see the top 10 teams by payroll. In other words, we want to:
- Group the data by the `TEAM` column: `groupby()`
- Add up the records in each group: `sum()`
- Sort the results by `SALARY` descending: `sort_values()`
- Take only the top 10 results: `head(10)`

Calling the `groupby()` method without telling it what to do with the grouped records isn't super helpful:

In [7]:
df.groupby('TEAM')

At this point, it's basically telling us that it has successfully grouped the records -- now what? Using method chaining, describe what you would like to _do_ with the numeric columns once you've grouped the data. Let's start with `sum()`:

In [11]:
df.groupby('TEAM').sum()

         SALARY  START_YEAR  END_YEAR  YEARS
TEAM
ARI    90730499       56469     56485     44
ATL   137339527       60491     60525     64
BAL   161684185       56460     56485     53
BOS   174287098       62510     62541     62
CHC   170088502       52429     52456     53
CIN    82375785       62516     62539     54
CLE   115991166       56455     56490     63
COL   101513571       64534     64553     51
CWS   109591167       56463     56487     52
DET   180250600       52420     52457     63
HOU   127443900       54449     54469     47
KC    132091916       56459     56496     65
LAA   143965833       60493     60522     59
LAD   187989811       62501     62550     80
MIA   115348302       56470     56501     59
MIL    61020089       52430     52445     41
MIN   100787500       58478     58500     51
NYM   176284679       62511     62534     54
NYY   170389199       54439     54472     60
OAK    70601667       60503     60513     40
PHI    87418378       52436     52444     34
PIT    94637833       52428     52456     54
SD     34574400       62527     62533     37
SEA   155207720       62510     62540     61
SF    176531278       56451     56499     76
STL   146630000       60487     60532     75
TB     69982520       64537     64557     52
TEX   178431396       68555     68593     72
TOR   162353367       58478     58499     50
WSH   162742157       52421     52457     62

Neat! Except it's summing _every_ numeric column, not just `SALARY`. To deal with this, use column filtering to select the two columns we're interested in -- `TEAM` for grouping and `SALARY` for summing -- and _then_ tack on the `groupby` statement, etc.

(Remember: To select columns from a data frame, use bracket notation and hand it a _list_ of column names.)

In [12]:
df[['TEAM', 'SALARY']].groupby('TEAM').sum()

         SALARY
TEAM
ARI    90730499
ATL   137339527
BAL   161684185
BOS   174287098
CHC   170088502
CIN    82375785
CLE   115991166
COL   101513571
CWS   109591167
DET   180250600
HOU   127443900
KC    132091916
LAA   143965833
LAD   187989811
MIA   115348302
MIL    61020089
MIN   100787500
NYM   176284679
NYY   170389199
OAK    70601667
PHI    87418378
PIT    94637833
SD     34574400
SEA   155207720
SF    176531278
STL   146630000
TB     69982520
TEX   178431396
TOR   162353367
WSH   162742157

Bang bang. Now, using method chaining, let's sort by `SALARY` descending and look at just the top 10:

In [13]:
df[['TEAM', 'SALARY']].groupby('TEAM').sum().sort_values('SALARY', ascending=False).head(10)

         SALARY
TEAM
LAD   187989811
DET   180250600
TEX   178431396
SF    176531278
NYM   176284679
BOS   174287098
NYY   170389199
CHC   170088502
WSH   162742157
TOR   162353367

You can use aggregation methods other than `sum()` -- `mean()` and `median()`, for instance -- or you can use [the `agg()` method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html) to specify one or more aggregation methods to apply.

In [19]:
df[['TEAM', 'SALARY']].groupby('TEAM').median()

       SALARY
TEAM
ARI   1300000
ATL   1250000
BAL   3462500
BOS   1950000
CHC   2750000
CIN    567000
CLE   2950000
COL    545000
CWS    875000
DET   1650000
HOU   3725000
KC    4000000
LAA   2250000
LAD   2600000
MIA   2762500
MIL    545950
MIN    600000
NYM   2200000
NYY   2290000
OAK    560000
PHI    562500
PIT   2962500
SD     545800
SEA   1325000
SF    2000000
STL   2762500
TB    1325000
TEX   1850000
TOR   2887500
WSH   4000000

In [18]:
df[['TEAM', 'SALARY']].groupby('TEAM').mean()

            SALARY
TEAM
ARI   3.240375e+06
ATL   4.577984e+06
BAL   5.774435e+06
BOS   5.622164e+06
CHC   6.541865e+06
CIN   2.657283e+06
CLE   4.142542e+06
COL   3.172299e+06
CWS   3.913970e+06
DET   6.932715e+06
HOU   4.720144e+06
KC    4.717568e+06
LAA   4.798861e+06
LAD   6.064187e+06
MIA   4.119582e+06
MIL   2.346926e+06
MIN   3.475431e+06
NYM   5.686603e+06
NYY   6.310711e+06
OAK   2.353389e+06
PHI   3.362245e+06
PIT   3.639917e+06
SD    1.115303e+06
SEA   5.006701e+06
SF    6.304688e+06
STL   4.887667e+06
TB    2.186954e+06
TEX   5.247982e+06
TOR   5.598392e+06
WSH   6.259314e+06

In [17]:
df[['TEAM', 'SALARY']].groupby('TEAM').agg(['sum', 'mean', 'median'])

         SALARY
            sum          mean   median
TEAM
ARI    90730499  3.240375e+06  1300000
ATL   137339527  4.577984e+06  1250000
BAL   161684185  5.774435e+06  3462500
BOS   174287098  5.622164e+06  1950000
CHC   170088502  6.541865e+06  2750000
CIN    82375785  2.657283e+06   567000
CLE   115991166  4.142542e+06  2950000
COL   101513571  3.172299e+06   545000
CWS   109591167  3.913970e+06   875000
DET   180250600  6.932715e+06  1650000
HOU   127443900  4.720144e+06  3725000
KC    132091916  4.717568e+06  4000000
LAA   143965833  4.798861e+06  2250000
LAD   187989811  6.064187e+06  2600000
MIA   115348302  4.119582e+06  2762500
MIL    61020089  2.346926e+06   545950
MIN   100787500  3.475431e+06   600000
NYM   176284679  5.686603e+06  2200000
NYY   170389199  6.310711e+06  2290000
OAK    70601667  2.353389e+06   560000
PHI    87418378  3.362245e+06   562500
PIT    94637833  3.639917e+06  2962500
SD     34574400  1.115303e+06   545800
SEA   155207720  5.006701e+06  1325000
SF    176531278  6.304688e+06  2000000
STL   146630000  4.887667e+06  2762500
TB     69982520  2.186954e+06  1325000
TEX   178431396  5.247982e+06  1850000
TOR   162353367  5.598392e+06  2887500
WSH   162742157  6.259314e+06  4000000

### ✍️ Your turn

In the cells below, practice grouping data:
- What's the median salary for each position? Group the data by `POS` and aggregate by `median()`, then sort by `SALARY` descending
- What's the average salary on each team? Group the data by `TEAM` and aggregate by `sum()`, then sort by `SALARY` descending
- What else?